# ============================================
# ОЛИМПИАДНЫЕ ЗАДАЧИ ПО ПРОГРАММИРОВАНИЮ
# ============================================
# Источники: LeetCode, Codeforces, Project Euler
# Время выполнения: 90+ минут
# ============================================

"""
🏆 ОЛИМПИАДНЫЕ ЗАДАЧИ

В этом файле 3 задачи олимпиадного уровня:
1. Two Sum (LeetCode #1) — Easy
2. Palindrome Number (LeetCode #9) — Easy
3. Climbing Stairs (LeetCode #70) — Easy (DP!)

📚 ПЕРЕД РЕШЕНИЕМ:
- Прочитайте olympiad_problems.md
- Там подробные объяснения, примеры, подсказки
- Начните с наивного решения, потом оптимизируйте!

💡 ЭТО СЛОЖНО — НЕ БОЙТЕСЬ СМОТРЕТЬ ПОДСКАЗКИ!
"""

print("""
="*60)
🏆 ОЛИМПИАДНЫЕ ЗАДАЧИ
="*60)

📖 ИНСТРУКЦИЯ:
1. Откройте olympiad_problems.md
2. Прочитайте описание задачи
3. Попробуйте решить самостоятельно (20-30 мин)
4. Если застряли — смотрите подсказки
5. Запускайте тесты
6. Оптимизируйте решение!

⚠️ НЕ СПЕШИТЕ С ОПТИМАЛЬНЫМ РЕШЕНИЕМ!
   Сначала — работающее, потом — быстрое.
""")

# ============================================
# ЗАДАЧА 1: TWO SUM (СУММА ДВУХ ЧИСЕЛ)
# ============================================

def two_sum(nums, target):
    """
    Найти индексы двух чисел, сумма которых равна target

    Источник: LeetCode #1
    Сложность: Easy
    Оптимальная сложность: O(n) время, O(n) память

    Параметры:
        nums (list): Список целых чисел
        target (int): Целевая сумма

    Возвращает:
        list: Два индекса [i, j] где nums[i] + nums[j] == target

    Примеры:
        two_sum([2, 7, 11, 15], 9) → [0, 1]
        two_sum([3, 2, 4], 6) → [1, 2]
        two_sum([3, 3], 6) → [0, 1]

    💡 ПОДСКАЗКИ:
    - Наивное решение: два вложенных цикла O(n²)
    - Оптимальное: используйте словарь (хэш-таблицу)
    - Для каждого числа ищите complement = target - число
    - Сохраняйте просмотренные числа в словаре {число: индекс}

    🎯 АЛГОРИТМ (оптимальный):
    1. Создать словарь seen = {}
    2. Для каждого индекса i и числа num:
       a. complement = target - num
       b. Если complement в seen: return [seen[complement], i]
       c. Иначе: seen[num] = i
    3. Если не найдено: return [] (но по условию решение всегда есть)
    """
    # TODO: Напишите код здесь
    # Попробуйте сначала O(n²) решение, потом O(n)
    pass


# Тесты для задачи 1
def test_two_sum():
    print("\n🧪 Тесты для two_sum():")

    tests = [
        ([2, 7, 11, 15], 9, [0, 1]),
        ([3, 2, 4], 6, [1, 2]),
        ([3, 3], 6, [0, 1]),
        ([1, 5, 3, 7, 9], 10, [1, 3]),  # 5 + 7 = 12? нет, 5+7=12, но target=10, значит 1+9=10, индексы [0,4]
        ([1, 5, 3, 7, 9], 10, [0, 4]),  # исправлено: 1 + 9 = 10
    ]

    for nums, target, expected in tests:
        result = two_sum(nums, target)
        # Проверяем что индексы правильные (порядок может быть разный)
        if result and len(result) == 2:
            is_correct = nums[result[0]] + nums[result[1]] == target
        else:
            is_correct = False

        status = "✅" if is_correct else "❌"
        print(f"{status} two_sum({nums}, {target}) = {result}")
        if not is_correct:
            print(f"   Ожидалось индексы где сумма = {target}")
            if result:
                print(f"   Ваш результат: nums[{result[0]}] + nums[{result[1]}] = {nums[result[0]] if result[0] < len(nums) else '?'} + {nums[result[1]] if result[1] < len(nums) else '?'}")


# ============================================
# ЗАДАЧА 2: PALINDROME NUMBER (ПАЛИНДРОМ-ЧИСЛО)
# ============================================

def is_palindrome_number(x):
    """
    Проверить, является ли число палиндромом БЕЗ преобразования в строку

    Источник: LeetCode #9
    Сложность: Easy
    Оптимальная сложность: O(log n) время, O(1) память

    Параметры:
        x (int): Целое число

    Возвращает:
        bool: True если палиндром, False иначе

    Примеры:
        is_palindrome_number(121) → True
        is_palindrome_number(-121) → False
        is_palindrome_number(10) → False
        is_palindrome_number(0) → True

    💡 ПОДСКАЗКИ:
    - Отрицательные числа НЕ палиндромы
    - Числа, оканчивающиеся на 0 (кроме 0), НЕ палиндромы
    - Математически переверните вторую половину числа
    - Сравните первую и вторую половины

    🎯 АЛГОРИТМ:
    1. if x < 0 or (x % 10 == 0 and x != 0): return False
    2. reversed_half = 0
    3. while x > reversed_half:
        a. reversed_half = reversed_half * 10 + x % 10
        b. x //= 10
    4. return x == reversed_half or x == reversed_half // 10
       (вторая проверка для нечётного количества цифр)
    """
    # TODO: Напишите код здесь
    # Попробуйте БЕЗ str(x)!
    pass


# Тесты для задачи 2
def test_is_palindrome_number():
    print("\n🧪 Тесты для is_palindrome_number():")

    tests = [
        (121, True),
        (-121, False),
        (10, False),
        (0, True),
        (12321, True),
        (12345, False),
        (1, True),
        (1001, True),
    ]

    for x, expected in tests:
        result = is_palindrome_number(x)
        status = "✅" if result == expected else "❌"
        print(f"{status} is_palindrome_number({x}) = {result} (ожидалось {expected})")


# ============================================
# ЗАДАЧА 3: CLIMBING STAIRS (ЛЕСТНИЦА)
# ============================================

def climb_stairs(n):
    """
    Сколькими способами можно подняться на n ступеней?
    Каждый раз можно сделать шаг 1 или 2.

    Источник: LeetCode #70
    Сложность: Easy (но важная для DP!)
    Оптимальная сложность: O(n) время, O(1) память

    Параметры:
        n (int): Количество ступеней

    Возвращает:
        int: Количество способов

    Примеры:
        climb_stairs(2) → 2  # (1+1, 2)
        climb_stairs(3) → 3  # (1+1+1, 1+2, 2+1)
        climb_stairs(4) → 5
        climb_stairs(5) → 8

    💡 ПОДСКАЗКИ:
    - Это последовательность Фибоначчи!
    - climb(1) = 1, climb(2) = 2
    - climb(n) = climb(n-1) + climb(n-2)
    - Почему? На ступень n можно прийти с (n-1) или (n-2)

    🎯 ПОДХОДЫ:

    Подход 1: Наивная рекурсия (МЕДЛЕННО!)
    def climb(n):
        if n <= 2: return n
        return climb(n-1) + climb(n-2)
    Сложность: O(2ⁿ) — НЕ ПРОХОДИТ для больших n

    Подход 2: Рекурсия с мемоизацией
    def climb(n, memo={}):
        if n in memo: return memo[n]
        if n <= 2: return n
        memo[n] = climb(n-1, memo) + climb(n-2, memo)
        return memo[n]
    Сложность: O(n) время, O(n) память

    Подход 3: Динамическое программирование
    if n <= 2: return n
    dp = [0] * (n + 1)
    dp[1], dp[2] = 1, 2
    for i in range(3, n + 1):
        dp[i] = dp[i-1] + dp[i-2]
    return dp[n]
    Сложность: O(n) время, O(n) память

    Подход 4: Оптимизация памяти (ЛУЧШИЙ!)
    if n <= 2: return n
    prev, curr = 1, 2
    for _ in range(3, n + 1):
        prev, curr = curr, prev + curr
    return curr
    Сложность: O(n) время, O(1) память
    """
    # TODO: Напишите код здесь
    # Попробуйте разные подходы!
    pass


# Тесты для задачи 3
def test_climb_stairs():
    print("\n🧪 Тесты для climb_stairs():")

    tests = [
        (1, 1),
        (2, 2),
        (3, 3),
        (4, 5),
        (5, 8),
        (10, 89),
        (15, 987),
        (20, 10946),
    ]

    for n, expected in tests:
        result = climb_stairs(n)
        status = "✅" if result == expected else "❌"
        print(f"{status} climb_stairs({n}) = {result} (ожидалось {expected})")


# ============================================
# БОНУСНАЯ ЗАДАЧА: FIBONACCI С МЕМОИЗАЦИЕЙ
# ============================================

def fibonacci_efficient(n):
    """
    Вычислить n-ое число Фибоначчи эффективно

    Это вспомогательная функция для понимания мемоизации.
    Используется в climb_stairs!

    Последовательность Фибоначчи:
    F(0) = 0, F(1) = 1
    F(n) = F(n-1) + F(n-2)

    Параметры:
        n (int): Номер числа Фибоначчи

    Возвращает:
        int: n-ое число Фибоначчи

    💡 ПОДСКАЗКА: Используйте один из подходов из climb_stairs
    """
    # TODO: Напишите код здесь
    pass


# Тесты для бонусной задачи
def test_fibonacci_efficient():
    print("\n🧪 Тесты для fibonacci_efficient() (БОНУС):")

    tests = [
        (0, 0),
        (1, 1),
        (10, 55),
        (20, 6765),
        (30, 832040),
    ]

    for n, expected in tests:
        result = fibonacci_efficient(n)
        status = "✅" if result == expected else "❌"
        print(f"{status} fibonacci_efficient({n}) = {result} (ожидалось {expected})")


# ============================================
# ЗАПУСК ВСЕХ ТЕСТОВ
# ============================================

def run_all_tests():
    """Запустить все тесты"""
    print("="*60)
    print("🏆 ЗАПУСК ОЛИМПИАДНЫХ ТЕСТОВ")
    print("="*60)

    test_two_sum()
    test_is_palindrome_number()
    test_climb_stairs()
    test_fibonacci_efficient()

    print("\n" + "="*60)
    print("🏁 ВСЕ ТЕСТЫ ЗАВЕРШЕНЫ")
    print("="*60)
    print("""
💡 СОВЕТЫ ДЛЯ ОЛИМПИАД:

1. **Читайте внимательно** — что именно нужно вернуть?
2. **Примеры — ваши друзья** — разберите их подробно
3. **Начните с наивного решения** — пусть медленное, но работающее
4. **Оптимизируйте постепенно** — не пытайтесь сразу написать O(n)
5. **Тестируйте на краевых случаях** — пустой массив, 0, 1, отрицательные
6. **Думайте о структурах данных** — словарь часто ускоряет на порядок
7. **Мемоизация = супер сила** — если много повторных вычислений
8. **Рисуйте на бумаге** — особенно для DP и рекурсии

🎯 СЛЕДУЮЩИЕ ШАГИ:

✅ **LeetCode Easy** — решайте по 1-2 задачи в день
   Темы: Arrays, Hash Table, Two Pointers, Sliding Window

✅ **Codeforces Div.2 A-B** — участвуйте в соревнованиях
   Разбирайте чужие решения после контеста

✅ **AtCoder Beginner Contest** — каждую неделю
   Очень качественные задачи с разбором

✅ **Изучайте паттерны:**
   - Two Pointers
   - Sliding Window
   - Hash Map
   - Dynamic Programming
   - Binary Search
   - DFS/BFS

✅ **Читайте решения** — учитесь у топовых программистов
   Смотрите Discuss на LeetCode, Editorials на Codeforces

🔥 ВЫ УЖЕ МНОГОЕ ЗНАЕТЕ!
   Теперь — практика, практика, практика!

🌟 REMEMBER: Every expert was once a beginner!
    """)


# Запуск при выполнении файла
if __name__ == "__main__":
    run_all_tests()
