# ============================================
# LEVEL 1: TEST-DRIVEN DEVELOPMENT (TDD)
# ============================================
# Тесты уже написаны — напишите код, который их пройдёт!
# Время выполнения: 50-60 минут
# ============================================

"""
🧪 TDD ДЛЯ СРЕДНЕГО УРОВНЯ

В Level 1 задачи сложнее:
✅ Условия (if/elif/else)
✅ Работа со строками (методы, срезы)
✅ Списки
✅ Простые алгоритмы

Подход тот же:
1. Читаете описание функции
2. Смотрите тесты
3. Пишете код
4. Запускаете → исправляете → повторяете
"""

# ============================================
# КАК РАБОТАТЬ С ЭТИМ ФАЙЛОМ
# ============================================

print("""
📚 ИНСТРУКЦИЯ:

1. Прочитайте описание функции и примеры
2. Посмотрите на тесты (что ожидается)
3. Напишите код функции
4. Запустите файл: python test_driven_level1.py
5. Если все тесты ✅ зелёные — переходите к следующей
6. Если есть ❌ красные — читайте что ожидалось и исправляйте

💡 ПОДСКАЗКИ в docstring каждой функции!
""")

# ============================================
# ЗАДАЧА 1: ПРОВЕРКА ПАЛИНДРОМА
# ============================================

def is_palindrome(text):
    """
    Проверить, является ли строка палиндромом

    Палиндром читается одинаково в обе стороны.
    Игнорируем регистр и пробелы.

    Параметры:
        text (str): Строка для проверки

    Возвращает:
        bool: True если палиндром, False если нет

    Примеры:
        is_palindrome("радар") → True
        is_palindrome("Анна") → True
        is_palindrome("А роза упала на лапу Азора") → True
        is_palindrome("привет") → False

    💡 ПОДСКАЗКИ:
    - Приведите к нижнему регистру: text.lower()
    - Уберите пробелы: text.replace(" ", "")
    - Сравните со строкой задом наперёд: text == text[::-1]
    """
    # TODO: Напишите код здесь
    pass


# Тесты для задачи 1
def test_is_palindrome():
    print("\n🧪 Тесты для is_palindrome():")

    tests = [
        ("радар", True),
        ("Анна", True),
        ("А роза упала на лапу Азора", True),
        ("шалаш", True),
        ("привет", False),
        ("Python", False),
        ("Level", False),
        ("", True),  # пустая строка — палиндром
    ]

    for text, expected in tests:
        result = is_palindrome(text)
        status = "✅" if result == expected else "❌"
        print(f"{status} is_palindrome('{text}') = {result} (ожидалось {expected})")


# ============================================
# ЗАДАЧА 2: ПОДСЧЁТ ГЛАСНЫХ
# ============================================

def count_vowels(text):
    """
    Посчитать количество гласных букв в тексте

    Гласные (русские): а, е, ё, и, о, у, ы, э, ю, я
    Учитываются и заглавные, и строчные.

    Параметры:
        text (str): Текст для анализа

    Возвращает:
        int: Количество гласных букв

    Примеры:
        count_vowels("Привет") → 2 (и, е)
        count_vowels("Программирование") → 6
        count_vowels("Бррр") → 0
        count_vowels("АААА") → 4

    💡 ПОДСКАЗКИ:
    - Список гласных: vowels = "аеёиоуыэюяАЕЁИОУЫЭЮЯ"
    - Переберите каждый символ: for char in text:
    - Проверьте: if char in vowels:
    - Увеличивайте счётчик
    """
    # TODO: Напишите код здесь
    pass


# Тесты для задачи 2
def test_count_vowels():
    print("\n🧪 Тесты для count_vowels():")

    tests = [
        ("Привет", 2),
        ("Программирование", 6),
        ("Бррр", 0),
        ("АААА", 4),
        ("Python", 0),  # английское слово, русских гласных нет
        ("Как дела?", 4),
        ("", 0),
    ]

    for text, expected in tests:
        result = count_vowels(text)
        status = "✅" if result == expected else "❌"
        print(f"{status} count_vowels('{text}') = {result} (ожидалось {expected})")


# ============================================
# ЗАДАЧА 3: ОЦЕНКА ПАРОЛЯ
# ============================================

def password_strength(password):
    """
    Оценить надёжность пароля

    Правила:
    - Длина >= 12: "Очень сильный"
    - Длина >= 8: "Сильный"
    - Длина >= 5: "Средний"
    - Иначе: "Слабый"

    Параметры:
        password (str): Пароль для проверки

    Возвращает:
        str: Оценка надёжности

    Примеры:
        password_strength("MySecurePassword123") → "Очень сильный"
        password_strength("Pass1234") → "Сильный"
        password_strength("Pass1") → "Средний"
        password_strength("123") → "Слабый"

    💡 ПОДСКАЗКИ:
    - Используйте len(password)
    - Проверяйте от большего к меньшему (if >= 12, elif >= 8...)
    """
    # TODO: Напишите код здесь
    pass


# Тесты для задачи 3
def test_password_strength():
    print("\n🧪 Тесты для password_strength():")

    tests = [
        ("MySecurePassword123", "Очень сильный"),
        ("Pass1234", "Сильный"),
        ("Python3!", "Сильный"),
        ("Pass1", "Средний"),
        ("abcde", "Средний"),
        ("123", "Слабый"),
        ("a", "Слабый"),
    ]

    for password, expected in tests:
        result = password_strength(password)
        status = "✅" if result == expected else "❌"
        print(f"{status} password_strength('{password}') = '{result}' (ожидалось '{expected}')")


# ============================================
# ЗАДАЧА 4: РЕВЕРС СЛОВ
# ============================================

def reverse_words(sentence):
    """
    Перевернуть порядок слов в предложении

    Параметры:
        sentence (str): Предложение

    Возвращает:
        str: Предложение с перевёрнутым порядком слов

    Примеры:
        reverse_words("Привет как дела") → "дела как Привет"
        reverse_words("Python это круто") → "круто это Python"
        reverse_words("Один") → "Один"
        reverse_words("") → ""

    💡 ПОДСКАЗКИ:
    - Разбейте на слова: words = sentence.split()
    - Переверните список: words[::-1]
    - Соедините обратно: " ".join(words)
    """
    # TODO: Напишите код здесь
    pass


# Тесты для задачи 4
def test_reverse_words():
    print("\n🧪 Тесты для reverse_words():")

    tests = [
        ("Привет как дела", "дела как Привет"),
        ("Python это круто", "круто это Python"),
        ("Один", "Один"),
        ("", ""),
        ("Раз два три четыре пять", "пять четыре три два Раз"),
    ]

    for sentence, expected in tests:
        result = reverse_words(sentence)
        status = "✅" if result == expected else "❌"
        print(f"{status} reverse_words('{sentence}') = '{result}'")
        if result != expected:
            print(f"   Ожидалось: '{expected}'")


# ============================================
# ЗАДАЧА 5: ПОИСК МАКСИМУМА В СПИСКЕ
# ============================================

def find_maximum(numbers):
    """
    Найти максимальное число в списке БЕЗ использования max()

    Параметры:
        numbers (list): Список чисел

    Возвращает:
        int или float: Максимальное число

    Примеры:
        find_maximum([1, 5, 3, 9, 2]) → 9
        find_maximum([10]) → 10
        find_maximum([-5, -1, -10]) → -1
        find_maximum([3.14, 2.71, 1.41]) → 3.14

    💡 ПОДСКАЗКИ:
    - Начальное значение: max_num = numbers[0]
    - Перебрать все числа: for num in numbers:
    - Если num > max_num: обновить max_num
    - Вернуть max_num
    """
    # TODO: Напишите код здесь
    pass


# Тесты для задачи 5
def test_find_maximum():
    print("\n🧪 Тесты для find_maximum():")

    tests = [
        ([1, 5, 3, 9, 2], 9),
        ([10], 10),
        ([-5, -1, -10], -1),
        ([3.14, 2.71, 1.41], 3.14),
        ([100, 200, 50, 175], 200),
    ]

    for numbers, expected in tests:
        result = find_maximum(numbers)
        status = "✅" if result == expected else "❌"
        print(f"{status} find_maximum({numbers}) = {result} (ожидалось {expected})")


# ============================================
# ЗАДАЧА 6: ИЗВЛЕЧЕНИЕ EMAIL USERNAME
# ============================================

def extract_username(email):
    """
    Извлечь имя пользователя из email (до @)

    Параметры:
        email (str): Email адрес

    Возвращает:
        str: Имя пользователя

    Примеры:
        extract_username("alice@example.com") → "alice"
        extract_username("bob.smith@company.org") → "bob.smith"
        extract_username("user123@mail.ru") → "user123"

    💡 ПОДСКАЗКИ:
    - Найдите позицию @: at_index = email.index("@")
    - Возьмите всё до @: email[:at_index]
    - Или используйте split: email.split("@")[0]
    """
    # TODO: Напишите код здесь
    pass


# Тесты для задачи 6
def test_extract_username():
    print("\n🧪 Тесты для extract_username():")

    tests = [
        ("alice@example.com", "alice"),
        ("bob.smith@company.org", "bob.smith"),
        ("user123@mail.ru", "user123"),
        ("test@test.com", "test"),
    ]

    for email, expected in tests:
        result = extract_username(email)
        status = "✅" if result == expected else "❌"
        print(f"{status} extract_username('{email}') = '{result}' (ожидалось '{expected}')")


# ============================================
# ЗАДАЧА 7: ФИЛЬТР ЧЁТНЫХ ЧИСЕЛ
# ============================================

def filter_even(numbers):
    """
    Вернуть только чётные числа из списка

    Параметры:
        numbers (list): Список чисел

    Возвращает:
        list: Список чётных чисел

    Примеры:
        filter_even([1, 2, 3, 4, 5, 6]) → [2, 4, 6]
        filter_even([1, 3, 5]) → []
        filter_even([2, 4, 6]) → [2, 4, 6]
        filter_even([]) → []

    💡 ПОДСКАЗКИ:
    - Создайте пустой список: result = []
    - Переберите числа: for num in numbers:
    - Если чётное (num % 2 == 0): добавьте в result
    - Вернуте result
    """
    # TODO: Напишите код здесь
    pass


# Тесты для задачи 7
def test_filter_even():
    print("\n🧪 Тесты для filter_even():")

    tests = [
        ([1, 2, 3, 4, 5, 6], [2, 4, 6]),
        ([1, 3, 5], []),
        ([2, 4, 6], [2, 4, 6]),
        ([], []),
        ([0, 1, 2], [0, 2]),
    ]

    for numbers, expected in tests:
        result = filter_even(numbers)
        status = "✅" if result == expected else "❌"
        print(f"{status} filter_even({numbers}) = {result}")
        if result != expected:
            print(f"   Ожидалось: {expected}")


# ============================================
# БОНУСНАЯ ЗАДАЧА: ПОДСЧЁТ СЛОВ В ТЕКСТЕ
# ============================================

def word_count(text):
    """
    Посчитать количество каждого слова в тексте

    Игнорируем регистр, знаки препинания не учитываем (упрощённо).

    Параметры:
        text (str): Текст для анализа

    Возвращает:
        dict: Словарь {слово: количество}

    Примеры:
        word_count("Привет мир Привет") → {"привет": 2, "мир": 1}
        word_count("Раз два раз") → {"раз": 2, "два": 1}
        word_count("") → {}

    💡 ПОДСКАЗКИ:
    - Приведите к нижнему регистру
    - Разбейте на слова: words = text.lower().split()
    - Создайте словарь: counts = {}
    - Для каждого слова:
      - Если слово уже есть: counts[word] += 1
      - Иначе: counts[word] = 1
    - Вернуте counts

    АЛЬТЕРНАТИВА (продвинутый способ):
    from collections import Counter
    return dict(Counter(text.lower().split()))
    """
    # TODO: Напишите код здесь
    pass


# Тесты для бонусной задачи
def test_word_count():
    print("\n🧪 Тесты для word_count() (БОНУС):")

    tests = [
        ("Привет мир Привет", {"привет": 2, "мир": 1}),
        ("Раз два раз", {"раз": 2, "два": 1}),
        ("", {}),
        ("Python Python Python", {"python": 3}),
        ("Один два три", {"один": 1, "два": 1, "три": 1}),
    ]

    for text, expected in tests:
        result = word_count(text)
        status = "✅" if result == expected else "❌"
        print(f"{status} word_count('{text}') = {result}")
        if result != expected:
            print(f"   Ожидалось: {expected}")


# ============================================
# ЗАПУСК ВСЕХ ТЕСТОВ
# ============================================

def run_all_tests():
    """Запустить все тесты"""
    print("="*60)
    print("🧪 ЗАПУСК ТЕСТОВ TDD LEVEL 1")
    print("="*60)

    test_is_palindrome()
    test_count_vowels()
    test_password_strength()
    test_reverse_words()
    test_find_maximum()
    test_extract_username()
    test_filter_even()
    test_word_count()

    print("\n" + "="*60)
    print("🏁 ВСЕ ТЕСТЫ ЗАВЕРШЕНЫ")
    print("="*60)
    print("""
💡 СОВЕТЫ:
- Если тест ❌ не прошёл — прочитайте, что ожидалось
- Исправьте код и запустите снова
- Все тесты ✅ зелёные? Отлично, переходите к Level 2!
- Застряли? Посмотрите подсказки в docstring функции
- Попробуйте сначала упрощённый вариант, потом улучшайте

🎯 СЛЕДУЮЩИЙ ШАГ:
Если все задачи решены → Level 2 (продвинутый уровень)
Если сложно → вернитесь к primm_level1.py
    """)


# Запуск при выполнении файла
if __name__ == "__main__":
    run_all_tests()
